{
  "architectures": [
    "ViTMAEForPreTraining"
  ],
  "attention_probs_dropout_prob": 0.0,
  "decoder_hidden_size": 512,
  "decoder_intermediate_size": 2048,
  "decoder_num_attention_heads": 16,
  "decoder_num_hidden_layers": 8,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.0,
  "hidden_size": 1280,
  "image_size": [16, 4096],
  "initializer_range": 0.02,
  "intermediate_size": 5120,
  "layer_norm_eps": 1e-12,
  "mask_ratio": 0.25,
  "model_type": "pixel",
  "norm_pix_loss": false,
  "num_attention_heads": 16,
  "num_channels": 3,
  "num_hidden_layers": 32,
  "patch_size": 14,
  "qkv_bias": true,
  "torch_dtype": "float32",
  "transformers_version": "4.16.0.dev0"
}
