{
  "_name_or_path": "pixel-model",
  "architectures": [
    "PIXELForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "decoder_hidden_size": 512,
  "decoder_intermediate_size": 2048,
  "decoder_num_attention_heads": 16,
  "decoder_num_hidden_layers": 8,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "O",
    "1": "B-DATE",
    "2": "I-DATE",
    "3": "B-PER",
    "4": "I-PER",
    "5": "B-ORG",
    "6": "I-ORG",
    "7": "B-LOC",
    "8": "I-LOC"
  },
  "image_size": [
    16,
    3136
  ],
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "interpolate_pos_encoding": false,
  "label2id": {
    "B-DATE": 1,
    "B-LOC": 7,
    "B-ORG": 5,
    "B-PER": 3,
    "I-DATE": 2,
    "I-LOC": 8,
    "I-ORG": 6,
    "I-PER": 4,
    "O": 0
  },
  "layer_norm_eps": 1e-12,
  "mask_ratio": 0.25,
  "model_type": "vit_mae",
  "norm_pix_loss": false,
  "num_attention_heads": 12,
  "num_channels": 3,
  "num_hidden_layers": 12,
  "patch_size": 16,
  "qkv_bias": true,
  "torch_dtype": "float32",
  "transformers_version": "4.17.0"
}
